<?php

namespace Database\Seeders;

use App\Models\City;
use Illuminate\Database\Seeder;

class CitySeeder extends Seeder
{
    public function run(): void
    {
        $cities = [
            'مكة المكرمة' => [
                'الحرم',
                'أجياد',
                'المؤمنين',
                'السويس',
                'العزيزية',
            ],
            'الرياض' => [
                'المربع',
                'الملز',
                'الصالحية',
                'السويدي',
                'الخالدية',
            ],
            'الدمام' => [
                'بحر...',
                'العوامية',
                'الملاحة',
                'المنصورة',
                'الروضة',
            ],
            'جدة' => [
                'التحلية',
                'الأميرية',
                'النسيم',
                'الشرفية',
                'السلامة',
            ],
            'المدينة المنورة' => [
                'البقيع',
                'الروحانيات',
                'المدينة الصناعية',
                'الحمراء',
                'العوالي',
            ],
            'الخبر' => [
                'الثقبة',
                'الخبر الشمالية',
                'الخبر الجنوبية',
                'البديع',
                'الفضول',
            ],
            'تبوك' => [
                'الشرف',
                'القدس',
                'الربوة',
                'الفيصلية',
                'العزيزية',
            ],
            'بريدة' => [
                'العليا',
                'العنابي',
                'الجنادرية',
                'القصيم',
                'الشامية',
            ],
            'حائل' => [
                'الشمال',
                'الوسط',
                'الجنوب',
                'الخالدية',
                'الفيصل',
            ],
            'جازان' => [
                'المدينة',
                'الفيصلية',
                'التحلية',
                'الهرجات',
                'الشقيق',
            ],
        ];

        foreach ($cities as $city => $neighborhoods) {
            $city = City::create([
                'country_id' => 1,
                'name' => $city,
            ]);

            // إضافة الأحياء عبر العلاقة
            foreach ($neighborhoods as $neighborhood) {
                $city->neighborhoods()->create(['name' => $neighborhood]);
            }
        }
    }
}
