<?php

namespace Database\Seeders;

use App\Models\Nationality;
use Illuminate\Database\Seeder;

class NationalitySeeder extends Seeder
{
    public function run(): void
    {
        $nationalities = [
            'سعودي',
            'بنغلاديشي',
            'هندي',
            'باكستاني',
            'نيبالي',
            'فلبيني',
            'سريلانكي',
            'إندونيسي',
            'تايلاندي',
            'إيراني',
            'يمني',
            'مصري',
            'سوري',
            'أردني',
            'فلسطيني',
            'لبناني',
            'العراقي',
            'كويتي',
            'بحريني',
            'قطري',
            'عُماني',
            'ليبي',
            'جزائري',
            'تونسِي',
            'مغربي',
            'سوداني',
            'إثيوبي',
            'أريتري',
            'صومالي',
            'تشادي',
            'غامبي',
            'أوغندي',
            'تنزاني',
            'كينِي',
            'غانِي',
            'سيراليونِي',
            'مالي',
            'كاميروني',
            'تركي',
            'أفغاني',
            'أمريكي',
            'بريطاني',
            'فرنسي',
            'ألماني',
            'باهنامي',
            'سوداني جنوبي',
            'ملاوي',
            'زامبي',
            'رواندي',
        ];

        foreach ($nationalities as $name) {
            Nationality::create(['name' => $name]);
        }
    }
}
